Tekla.Structures.Internal.StructuresPluginDescriptor


Tekla.Structures.Internal.StructuresPluginDescriptor._baseType


Tekla.Structures.Internal.StructuresPluginDescriptor._userInterfaceDescription


Tekla.Structures.Internal.StructuresPluginDescriptor._magicDict


Tekla.Structures.Internal.StructuresPluginDescriptor.#ctor(System.String,System.String,System.Type,System.Collections.Generic.IDictionary{System.Type,System.Attribute[]})


Tekla.Structures.Internal.StructuresPluginDescriptor.Name


Tekla.Structures.Internal.StructuresPluginDescriptor.UserInterfaceDescription


Tekla.Structures.Internal.StructuresPluginDescriptor.CreateInstance(Tekla.Structures.Internal.ITsInvoker,Tekla.Structures.Internal.StructuresDataStorageBase)


Tekla.Structures.Internal.StructuresPluginDescriptor.GetAllParameters(System.Collections.Generic.Dictionary{System.String,System.Reflection.FieldInfo}@)


Tekla.Structures.Internal.StructuresPluginDescriptor.ReadParametersFromInstance(System.Object)


Tekla.Structures.Internal.StructuresPluginDescriptor.WriteParametersToInstance(System.Object)


Tekla.Structures.Internal.StructuresPluginDescriptor.FinishInstance(System.Object)


Tekla.Structures.Internal.StructuresPluginDescriptor.ToString


Tekla.Structures.Internal.StructuresPluginDescriptor.RebuildRemoteObjectDictionary(System.Collections.IDictionary)
Rebuilds the remote object dictionary so that only alive objects are left in it.
dictionary: The dictionary to rebuild.